wujique/stm32f407/app/wujique_stm407.c
	fun_sound_play("1:/mono_16bit_8k.wav", "dacsound");
	wjq_wait_key(16);
	fun_sound_stop();
	wjq_log(LOG_DEBUG,"dac test out\r\n");
	return 0;
}
s32 test_sound_rec(void)
{
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);

	fun_sound_rec("1:/rec8.wav");
	wjq_wait_key(16);
	fun_rec_stop();
	fun_sound_play("1:/rec8.wav", "wm8978");	
	while(1)
	{
		if(SOUND_IDLE == fun_sound_get_sta())
			break;

		u8 keyvalue;
		s32 res;
		
		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}
	}
	wjq_log(LOG_DEBUG, "test_sound_rec OUT!\r\n");
	return 0;
}


#include "tslib-private.h"
extern struct tsdev *ts_open_module(void);
s32 test_tp_calibrate(void)
{
	DevLcdNode *lcd;

	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	/*顶行居中显示父菜单*/
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);

	lcd = dev_lcd_open("tftlcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open lcd err!");	
	}
	else
	{
		dev_lcd_setdir(lcd, H_LCD, L2R_U2D);
		dev_touchscreen_open();
		ts_calibrate(lcd);
		dev_touchscreen_close();
	}
	
	dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);
	dev_lcd_close(lcd);
	
	return 0;
}


s32 test_tp_test(void)
{
	DevLcdNode *lcd;

	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	/*顶行居中显示父菜单*/
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	
	lcd = dev_lcd_open("tftlcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open lcd err!");	
	}
	else
	{
		dev_lcd_setdir(lcd, H_LCD, L2R_U2D);
		dev_touchscreen_open();	
	
		struct tsdev *ts;
		ts = ts_open_module();

		struct ts_sample samp[10];
		int ret;
		u8 i =0;	
		while(1)
		{
			ret = ts_read(ts, samp, 10);
			if(ret != 0)
			{
				//uart_printf("pre:%d, x:%d, y:%d\r\n", samp[0].pressure, samp[0].x, samp[0].y);
						
				i = 0;
				
				while(1)
				{
					if(i>= ret)
						break;
					
					if(samp[i].pressure != 0 )
					{
						//uart_printf("pre:%d, x:%d, y:%d\r\n", samp.pressure, samp.x, samp.y);
						dev_lcd_drawpoint(lcd, samp[i].x, samp[i].y, RED); 
					}
					i++;
				}
			}

			u8 keyvalue;
			s32 res;
			
			res = dev_keypad_read(&keyvalue, 1);
			if(res == 1)
			{
				if(keyvalue == 8)
				{
					dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);
				}
				else if(keyvalue == 12)
				{
					break;
				}
			}
		}

		dev_touchscreen_close();
	}
	return 0;
}


s32 test_key(void)
{
	u8 tmp;
	s32 res;
	u8 keyvalue;
		
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	
	dev_key_open();

	while(1)
	{
		res = dev_key_read(&tmp, 1);
		if(1 == res)
		{
			if(tmp == DEV_KEY_PRESS)
			{
				dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 10, "	   press	", BLACK);
			}
			else if(tmp == DEV_KEY_REL)
			{
				dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 10, "	 release	  ", BLACK);
			}
		}

		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}
	}


	dev_key_close();
	return 0;
}


s32 test_camera(void)
{
	DevLcdNode *lcd;

	//dev_lcd_color_fill(emenulcd, 1, 1000, 1, 1000, WHITE);
	/*顶行居中显示父菜单*/
	//dev_lcd_put_string(emenulcd, FONT_SONGTI_1212, 1, 32, __FUNCTION__, BLACK);
	
	lcd = dev_lcd_open("tftlcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open lcd err!");	
	}
	else
	{
		dev_camera_open();
		dev_camera_show(lcd);
			
	}
	wjq_wait_key(16);

	dev_camera_close();
	dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);
	
	return 0;
}
s32 test_rs485_rec(void)
{
	u8 keyvalue;
	u8 buf[20];
	u8 len;
	s32 res;
	
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);

	dev_rs485_open();

	while(1)
	{
		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}

		len = dev_rs485_read(buf, sizeof(buf));
		if(len > 0)
		{
			buf[len] = 0;
			wjq_log(LOG_DEBUG,"%s", buf);
			memset(buf, 0, sizeof(buf));
		}

	}

	return 0;
}

s32 test_rs485_snd(void)
{
	u8 keyvalue;
	s32 res;
	
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	
	dev_rs485_open();

	while(1)
	{
		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
			else if(keyvalue == 16)
			{
				res = dev_rs485_write("rs485 test\r\n", 14);
				wjq_log(LOG_DEBUG, "dev rs485 write:%d\r\n", res);
			}
		}
	}
	return 0;
}

s32 test_can_rec(void)
{
	wjq_test_showstr((char *)__FUNCTION__);
	return 0;
}
s32 test_can_snd(void)
{
	wjq_test_showstr((char *)__FUNCTION__);
	return 0;
}
s32 test_uart(void)
{
	u8 keyvalue;
	u8 buf[12];
    s32 len;
    s32 res;
	
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	
	while(1)
	{
		
	    len =  mcu_uart_read (MCU_UART_3, buf, 10);
		if(len > 0)
		{
	    	res = mcu_uart_write(MCU_UART_3, buf, len);
		}

		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}
	}
	return 0;
}
/*

	简单测试，串口发送AT命令，收到OK即可。

*/
s32 test_esp8266(void)
{
	u8 keyvalue;	
	u8 buf[32];
	u16 len;
	u32 timeout = 0;
	s32 res;
	
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
		
	dev_8266_open();

	while(1)
	{
		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}
		
		Delay(500);
		dev_8266_write("at\r\n", 4);
		timeout = 0;
		while(1)
		{
			Delay(50);
			memset(buf, 0, sizeof(buf));
			len = dev_8266_read(buf, sizeof(buf));
			if(len != 0)
			{
				wjq_log(LOG_FUN, "%s", buf);
			}
			
