wujique/stm32f407/app/wujique_stm407.c
			timeout++;
			if(timeout >= 100)
			{
				wjq_log(LOG_FUN, "timeout---\r\n");
				break;
			}
		}
	}

	return 0;
}



s32 wjq_test(void)
{
	wjq_test_showstr((char *)__FUNCTION__);
	return 0;
}

s32 test_spiflash_board(void)
{
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	dev_spiflash_test_chipcheck("board_spiflash");
	wjq_wait_key(12);
	return 0;
}

s32 test_spiflash_core(void)
{
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	dev_spiflash_test_chiperase("core_spiflash");
	wjq_wait_key(12);
	return 0;
}

s32 test_touchkey(void)
{
	u8 tmp;
	s32 res;
	u8 keyvalue;
		
	dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
	dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 32, (char *)__FUNCTION__, BLACK);
	dev_touchkey_open();

	while(1)
	{
		res = dev_touchkey_read(&tmp, 1);
		if(1 == res)
		{
			if(tmp == DEV_TOUCHKEY_TOUCH)
			{
				wjq_log(LOG_FUN, "touch key test get a touch event!\r\n");
				dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 10, "      touch    ", BLACK);
			}
			else if(tmp == DEV_TOUCHKEY_RELEASE)
			{
				wjq_log(LOG_FUN, "touch key test get a release event!\r\n");
				dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 10, "      release    ", BLACK);
			}
		}

		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1)
		{
			if(keyvalue == 12)
			{
				break;
			}
		}
	}


	dev_touchkey_close();
	return 0;
}


s32 test_keypad(void)
{
	u8 dis_flag = 1;
	u8 keyvalue;
	s32 res;
	s32 esc_flag = 1;
	
	char testkeypad1[]="1 2 3 F1 ";
	char testkeypad2[]="4 5 6 DEL";
	char testkeypad3[]="7 8 9 ESC";
	char testkeypad4[]="* 0 # ENT";
	
	dev_keypad_open();

	while(1)
	{
		if(dis_flag == 1)
		{
			dev_lcd_color_fill(WJQTestLcd, 1, 1000, 1, 1000, WHITE);
			dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 1, (char *)__FUNCTION__, BLACK);
			dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 13, testkeypad1, BLACK);
			dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 26, testkeypad2, BLACK);
			dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 39, testkeypad3, BLACK);
			dev_lcd_put_string(WJQTestLcd, FONT_SONGTI_1212, 1, 52, testkeypad4, BLACK);
			dis_flag = 0;
		}
		
		res = dev_keypad_read(&keyvalue, 1);
		if(res == 1 && ((keyvalue & KEYPAD_PR_MASK) == 0))
		{
			dis_flag = 1;
			switch(keyvalue)
			{
				case 1:
					testkeypad1[0] = ' ';
					break;
				case 2:
					testkeypad1[2] = ' ';
					break;
				case 3:
					testkeypad1[4] = ' ';
					break;
				case 4:
					testkeypad1[6] = ' ';
					testkeypad1[7] = ' ';
					testkeypad1[8] = ' ';
					break;
				case 5:
					testkeypad2[0] = ' ';
					break;
				case 6:
					testkeypad2[2] = ' ';
					break;
				case 7:
					testkeypad2[4] = ' ';
					break;
				case 8:
					testkeypad2[6] = ' ';
					testkeypad2[7] = ' ';
					testkeypad2[8] = ' ';
					break;
				case 9:
					testkeypad3[0] = ' ';
					break;
				case 10:
					testkeypad3[2] = ' ';
					break;
				case 11:
					testkeypad3[4] = ' ';
					break;
				case 12:
					if(esc_flag == 1)
					{
						esc_flag = 0;
						testkeypad3[6] = ' ';
						testkeypad3[7] = ' ';
						testkeypad3[8] = ' ';
					}
					else
					{
						return 0;
					}
					break;

				case 13:
					testkeypad4[0] = ' ';
					break;
				case 14:
					testkeypad4[2] = ' ';
					break;
				case 15:
					testkeypad4[4] = ' ';
					break;
				case 16:
					testkeypad4[6] = ' ';
					testkeypad4[7] = ' ';
					testkeypad4[8] = ' ';
					break;
			} 
		}
	}

}


const MENU WJQTestList[]=
{
	MENU_L_0,//菜单等级
	"测试程序",//中文
	"test",	//英文
	MENU_TYPE_KEY_2COL,//菜单类型
	NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

		MENU_L_1,//菜单等级
		"LCD",//中文
		"LCD",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			MENU_L_2,//菜单等级
			"VSPI OLED",//中文
			"VSPI OLED",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_vspi_oled_display,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"I2C OLED",//中文
			"I2C OLED",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_i2c_oled_display,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"SPI COG",//中文
			"SPI COG",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_spi_cog_display,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"tft",//中文
			"tft",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_tft_display,//菜单函数，功能菜单才会执行，有子菜单的不会执行
	
			MENU_L_2,//菜单等级
			"图片测试",//中文
			"test BMP",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_lcd_pic,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
			MENU_L_2,//菜单等级
			"字库测试",//中文
			"test Font",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_lcd_font,//菜单函数，功能菜单才会执行，有子菜单的不会执行

		MENU_L_1,//菜单等级
		"声音",//中文
		"sound",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			MENU_L_2,//菜单等级
			"蜂鸣器",//中文
			"buzzer",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_sound_buzzer,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"DAC音乐",//中文
			"DAC music",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_sound_dac,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"收音",//中文
			"FM",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_sound_fm,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"I2S音乐",//中文
			"I2S Music",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_sound_wm8978,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"录音",//中文
			"rec",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_sound_rec,//菜单函数，功能菜单才会执行，有子菜单的不会执行

		MENU_L_1,//菜单等级
		"触摸屏",//中文
		"tp",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
			MENU_L_2,//菜单等级
			"校准",//中文
			"calibrate",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_tp_calibrate,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"测试",//中文
			"test",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_tp_test,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
		MENU_L_1,//菜单等级
		"按键",//中文
		"KEY",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			MENU_L_2,//菜单等级
			"核心板按键",//中文
			"core KEY",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_key,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
			/*触摸按键*/
			MENU_L_2,//菜单等级
			"触摸按键",//中文
			"touch key",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_touchkey,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			/*可以不测，本来测试程序就要使用矩阵按键*/
			MENU_L_2,//菜单等级
			"矩阵按键",//中文
			"keypad",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_keypad,//菜单函数，功能菜单才会执行，有子菜单的不会执行
		
		MENU_L_1,//菜单等级
		"摄像",//中文
		"camera",	//英文
		MENU_TYPE_FUN,//菜单类型
		test_camera,//菜单函数，功能菜单才会执行，有子菜单的不会执行
		
		MENU_L_1,//菜单等级
		"SPI FLASH",//中文
		"SPI FLASH",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			MENU_L_2,//菜单等级
			"核心板FLASH",//中文
			"core FLASH",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_spiflash_core,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
			MENU_L_2,//菜单等级
			"底板 FLASH",//中文
			"board FLASH",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_spiflash_board,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
		MENU_L_1,//菜单等级
		"通信",//中文
		"通信",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"485",//中文
			"485",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				MENU_L_3,//菜单等级
				"485 接收",//中文
				"485 rec",	//英文
				MENU_TYPE_FUN,//菜单类型
				test_rs485_rec,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				MENU_L_3,//菜单等级
				"485 发送",//中文
				"485 snd",	//英文
				MENU_TYPE_FUN,//菜单类型
				test_rs485_snd,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
			MENU_L_2,//菜单等级
			"CAN",//中文
			"CAN",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				MENU_L_3,//菜单等级
				"CAN 接收",//中文
				"CAN rec",	//英文
				MENU_TYPE_FUN,//菜单类型
				test_can_rec,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				
