wujique/stm32f407/app/wujique_stm407.c
				MENU_L_3,//菜单等级
				"CAN 发送",//中文
				"CAN snd",	//英文
				MENU_TYPE_FUN,//菜单类型
				test_can_snd,//菜单函数，功能菜单才会执行，有子菜单的不会执行
			
		
		
			MENU_L_2,//菜单等级
			"串口",//中文
			"uart",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_uart,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"网络",//中文
			"eth",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"OTG",//中文
			"OTG",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				MENU_L_3,//菜单等级
				"HOST",//中文
				"HOST",	//英文
				MENU_TYPE_LIST,//菜单类型
				NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
				MENU_L_3,//菜单等级
				"Device",//中文
				"Device",	//英文
				MENU_TYPE_LIST,//菜单类型
				NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
		MENU_L_1,//菜单等级
		"模块",//中文
		"模块",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
		
			/*外扩接口测试*/
			MENU_L_2,//菜单等级
			"RF24L01",//中文
			"RF24L01",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			MENU_L_2,//菜单等级
			"MPU6050",//中文
			"MPU6050",	//英文
			MENU_TYPE_LIST,//菜单类型
			NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

			/*用串口外扩8266模块*/
			MENU_L_2,//菜单等级
			"wifi",//中文
			"wifi",	//英文
			MENU_TYPE_FUN,//菜单类型
			test_esp8266,//菜单函数，功能菜单才会执行，有子菜单的不会执行
		

		MENU_L_1,//菜单等级
		"test",//中文
		"test",	//英文
		MENU_TYPE_LIST,//菜单类型
		NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行

	
	/*最后的菜单是结束菜单，无意义*/			
	MENU_L_0,//菜单等级
	"END",//中文
	"END",	//英文
	MENU_TYPE_NULL,//菜单类型
	NULL,//菜单函数，功能菜单才会执行，有子菜单的不会执行
};


void wujique_stm407_test(void)
{
	wjq_log(LOG_DEBUG,"run app\r\n");

	
	WJQTestLcd = dev_lcd_open("i2coledlcd");
	if(WJQTestLcd == NULL)
	{
		wjq_log(LOG_DEBUG, "open oled lcd err\r\n");
	}

	dev_key_open();
	dev_keypad_open();

	emenu_run(WJQTestLcd, (MENU *)&WJQTestList[0], sizeof(WJQTestList)/sizeof(MENU));	
	while(1)
	{
	}
}

#define Wujique407_TASK_STK_SIZE (4096)
#define Wujique407_TASK_PRIO	1
TaskHandle_t  Wujique407TaskHandle;


s32 wujique_407test_init(void)
{
	xTaskCreate(	(TaskFunction_t) wujique_stm407_test,
					(const char *)"wujique 407 test task",		/*lint !e971 Unqualified char types are allowed for strings and single characters only. */
					(const configSTACK_DEPTH_TYPE) Wujique407_TASK_STK_SIZE,
					(void *) NULL,
					(UBaseType_t) Wujique407_TASK_PRIO,
					(TaskHandle_t *) &Wujique407TaskHandle );	
					
	return 0;
}

/*

生产测试

*/

s32 test_tft_lcd(void)
{
	DevLcdNode *lcd;
	u8 step = 0;
	u8 dis = 1;
	
	lcd = dev_lcd_open("tftlcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open tft lcd err!");	
	}
	else
	{
		while(1)
		{
			if(dis == 1)
			{
				dis = 0;
				switch(step)
				{
					case 0:
						dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, YELLOW);
						break;
					
					case 1:
						dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, RED);
						break;
					
					case 2:
						dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);
						dev_lcd_put_string(lcd, FONT_SONGTI_1616, 20, 20, "abc屋脊雀工作室ADC", RED);
						break;

					case 3:
						dev_lcd_show_bmp(lcd, 1, 1, 320, 240, "1:/pic/女人单色.bmp");
						break;
					
					case 4:
						dev_lcd_show_bmp(lcd, 1, 1, 320, 240, "1:/pic/女人24位.bmp");//真彩色
						break;
					case 5:
						dev_lcd_backlight(lcd, 0);
						break;
					case 6:
						dev_lcd_backlight(lcd, 1);
						break;		
					default:
						break;
				}
				step++;
				if(step >= 7)
					step = 0;
			}
			u8 keyvalue;
			s32 res;
			
			res = dev_keypad_read(&keyvalue, 1);
			if(res == 1)
			{
				if(keyvalue == 16)
				{
					dis = 1;
				}
				else if(keyvalue == 12)
				{
					break;
				}
			}
		}

	}
	dev_lcd_close(lcd);
	return 0;
}

s32 test_cog_lcd(void)
{
	DevLcdNode *lcd;
	u8 step = 0;
	u8 dis = 1;
	
	lcd = dev_lcd_open("spicoglcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open cog lcd err!");	
		while(1);
	}

	while(1)
	{
		dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLACK);
		wjq_wait_key(16);
		dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, WHITE);
		wjq_wait_key(16);
		dev_lcd_put_string(lcd, FONT_SONGTI_1212, 1, 32, "cog LCD测试程序", BLACK);
		wjq_wait_key(16);
		dev_lcd_backlight(lcd, 0);
		wjq_wait_key(16);
		dev_lcd_backlight(lcd, 1);
		wjq_wait_key(16);
	}
	
	return 0;
}

s32 test_tft_tp(void)
{
	DevLcdNode *lcd;


	lcd = dev_lcd_open("tftlcd");
	if(lcd == NULL)
	{
		wjq_test_showstr("open lcd err!");	
	}
	else
	{
		dev_lcd_backlight(lcd, 1);
		
		dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);
		dev_lcd_setdir(lcd, H_LCD, L2R_U2D);
		dev_touchscreen_open();
		ts_calibrate(lcd);
		dev_touchscreen_close();
	}
	
	dev_lcd_color_fill(lcd, 1, 1000, 1, 1000, BLUE);

	{
		dev_touchscreen_open();	
	
		struct tsdev *ts;
		ts = ts_open_module();

		struct ts_sample samp[10];
		int ret;
		u8 i =0;	
		while(1)
		{
			ret = ts_read(ts, samp, 10);
			if(ret != 0)
			{
				//uart_printf("pre:%d, x:%d, y:%d\r\n", samp[0].pressure, samp[0].x, samp[0].y);
						
				i = 0;
				
				while(1)
				{
					if(i>= ret)
						break;
					
					if(samp[i].pressure != 0 )
					{
						//uart_printf("pre:%d, x:%d, y:%d\r\n", samp.pressure, samp.x, samp.y);
						dev_lcd_drawpoint(lcd, samp[i].x, samp[i].y, 0xF800); 
					}
					i++;
				}
			}

		}

		dev_touchscreen_close();
	}
	return 0;
}


